## Pandas-tehtävät

#### Huom: Koko harjoituksen ajan on tarkoitus käsitellä alkuperäistä dataframea!

#### Tehtävä 1. Lisää tarvittavat kirjastot ja lue `testidata.csv` niminen tiedosto DataFrame-objektiin

In [73]:
import pandas as pd

In [74]:
dataframe=pd.read_csv("testidata.csv")

#### Tehtävä 2. Tulosta DataFrame-objektin viisi viimeistä riviä

In [75]:
dataframe.tail()

    Unnamed: 0   sarake1   sarake2   sarake3
20          20  0.300589  0.455980  0.292225
21          21  0.859970  0.346539  0.364629
22          22  0.842364  0.093485  0.662066
23          23  0.781693  0.573344  0.815692
24          24  0.788949  0.945625  0.852690

In [76]:
dataframe.tail(5)

    Unnamed: 0   sarake1   sarake2   sarake3
20          20  0.300589  0.455980  0.292225
21          21  0.859970  0.346539  0.364629
22          22  0.842364  0.093485  0.662066
23          23  0.781693  0.573344  0.815692
24          24  0.788949  0.945625  0.852690

#### Tehtävä 3. Tulosta datan sarakkeiden otsikot list-objektina

In [77]:
columns = list(dataframe)
columns

['Unnamed: 0', 'sarake1', 'sarake2', 'sarake3']

#### Tehtävä 4. Tulosta `sarake2`:n pituus

In [78]:
lenght_sarake2=dataframe["sarake2"].shape
lenght_sarake2

(25,)

#### Tehtävä 5. Tulosta datan ensimmäinen rivin tiedot

In [79]:
dataframe.head()

   Unnamed: 0   sarake1   sarake2   sarake3
0           0  0.319219  0.380058  0.919389
1           1  0.922251  0.490721  0.133932
2           2  0.073746  0.929162  0.962745
3           3  0.363707  0.878349  0.485700
4           4  0.106903  0.714651  0.039953

#### Tehtävä 6. Pudota datasta  `Unnamed: 0` niminen sarake ja todenna lopputulos valitsemallasi tavalla

In [80]:
df_fixed = pd.read_csv('testidata.csv', index_col=0)
df_fixed.head()

    sarake1   sarake2   sarake3
0  0.319219  0.380058  0.919389
1  0.922251  0.490721  0.133932
2  0.073746  0.929162  0.962745
3  0.363707  0.878349  0.485700
4  0.106903  0.714651  0.039953

#### Tehtävä 7. Poista rivit, jos sarakkeessa `sarake1` esiintyy arvo 0.2 tai pienempi

In [81]:
dataframe1 = df_fixed.loc[df_fixed['sarake2'] <= 0.2]
dataframe1

     sarake1   sarake2   sarake3
6   0.323134  0.036466  0.186775
8   0.303299  0.096971  0.451031
19  0.007302  0.005471  0.790344
22  0.842364  0.093485  0.662066

#### Tehtävä 8. Tulosta `sarake1` sarakkeen minimi- ja maksimiarvo

In [82]:
sarake1 = df_fixed["sarake1"]
min_value=sarake1.min()
min_value

0.00730163662796035

In [83]:
sarake1 = df_fixed["sarake1"]
max_value=sarake1.max()
max_value

0.9358745961778226

#### Tehtävä 9. Tee ensimmäisen rivin ensimmäisen sarakkeen arvosta nan

In [84]:
df_fixed.head()

    sarake1   sarake2   sarake3
0  0.319219  0.380058  0.919389
1  0.922251  0.490721  0.133932
2  0.073746  0.929162  0.962745
3  0.363707  0.878349  0.485700
4  0.106903  0.714651  0.039953

In [85]:
df_nan=df_fixed.iloc[0,0]="nan"

In [86]:
df_fixed.head()

     sarake1   sarake2   sarake3
0        nan  0.380058  0.919389
1   0.922251  0.490721  0.133932
2  0.0737458  0.929162  0.962745
3   0.363707  0.878349  0.485700
4   0.106903  0.714651  0.039953

#### Tehtävä 10. Tallenna lopputulos data_export.csv-nimiseen tiedostoon (tiedostoa hyödynnetään seuraavassa harjoituksessa).

In [87]:
df_fixed.to_csv("data_export.csv")